[
  {
    "insert": "NAME:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "PRANAV V\n\n"
  },
  {
    "insert": "CONTACT INFORMATION:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "{\n  \"Address\": \"No.19, Anandha Dhamma 3rd Main Road, Optimum Garden Layout, Ayyapanagar, K R Puram, Bengaluru – 560036.\",\n  \"Email\": [\n    \"prv22aiml@cmrit.ac.in\",\n    \"pranavv736@gmail.com\"\n  ],\n  \"Mobile Number\": \"+91-7676858328\",\n  \"LinkedIn\": \"https://www.linkedin.com/in/pranav-venu-550729264/\",\n  \"GitHub\": \"https://github.com/pranavv1210\"\n}\n\n"
  },
  {
    "insert": "CAREER OBJECTIVE:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "Machine Learning enthusiast skilled in Java, Python, SQL and full-stack development using React, Django and Flutter. Experienced with Azure, data structures and machine learning algorithms. Passionate about applying AI to real-world problems with a strong foundation in deep learning, generative models and AI research.\n\n"
  },
  {
    "insert": "EDUCATION:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "[\n  {\n    \"Degree\": \"Bachelor of Engineering – Artificial Intelligence and Machine Learning\",\n    \"Institution\": \"CMR Institute of Technology, AECS Layout, Bengaluru\",\n    \"CGPA\": \"8.46\",\n    \"Year\": \"2026 (Pursuing)\"\n  },\n  {\n    \"Degree\": \"Pre-University Course - Science (PCMB)\",\n    \"Institution\": \"St Joseph's Pre University College, Museum Road, Bengaluru\",\n    \"Percentage\": \"83.3%\",\n    \"Year\": \"2022\"\n  },\n  {\n    \"Degree\": \"10th Grade – ICSE\",\n    \"Institution\": \"Cambridge School, K R Puram, Bengaluru\",\n    \"Percentage\": \"81.8%\",\n    \"Year\": \"2020\"\n  }\n]\n\n"
  },
  {
    "insert": "TECHNICAL SKILLS:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "\n\n"
  },
  {
    "insert": "PROJECTS:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "[\n  {\n    \"Name\": \"AI Resume Screening System with Chatbot Integration (Ongoing)\",\n    \"Description\": \"Developing a comprehensive web application to revolutionize recruitment by automating resume screening and enhancing candidate engagement. This system leverages advanced AI/NLP to accurately parse resumes, semantically match candidates to job descriptions, and provide explainable, bias-mitigated scores. It features a proactive, AI-driven chatbot offering real-time resume feedback to candidates before submission, alongside robust HR tools for collaborative evaluation and intelligent insights.\",\n    \"Tech Stack\": [\n      \"React.js\",\n      \"Node.js (Express)\",\n      \"AI/NLP (Hugging Face, spaCy)\",\n      \"MongoDB\",\n      \"Auth.js\",\n      \"Rasa Open Source\"\n    ]\n  },\n  {\n    \"Name\": \"Personal Portfolio Website\",\n    \"Description\": \"Built a responsive personal portfolio website using React to showcase projects, skills, and experience. Implemented a clean, modern UI with reusable components and smooth navigation. Deployed the site on GitHub Pages, ensuring mobile responsiveness and fast load times for an optimized user experience.\",\n    \"Tech Stack\": [\n      \"React\",\n      \"HTML\",\n      \"CSS\",\n      \"JavaScript\",\n      \"GitHub Pages\"\n    ]\n  },\n  {\n    \"Name\": \"Age and Gender Detection using AI\",\n    \"Description\": \"Developed a real-time Age and Gender Detection system leveraging Computer Vision (OpenCV) and pre-trained Deep Learning (Caffe-based Convolutional Neural Networks). The system dynamically processes live webcam streams and static images/videos to perform robust face detection. Subsequent to detection, cropped facial regions are fed into specialized CNN models for accurate gender classification and age estimation. This AI-powered solution showcases proficiency in Python and deep learning frameworks, enabling the extraction of immediate demographic insights critical for applications in smart surveillance, retail analytics, and interactive systems.\",\n    \"Tech Stack\": [\n      \"Python\",\n      \"OpenCV\",\n      \"Argparse\",\n      \"Deep Learning (Caffe Models)\"\n    ]\n  }\n]\n\n"
  },
  {
    "insert": "CO-CURRICULAR AND EXTRA-CURRICULAR ACTIVITIES:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "{\n  \"Hackathons/Competitions\": [\n    \"Participated in “Full Stack Fiesta: Innovate, Build, Deploy” hackathon organized by CMR Institute of Technology.\"\n  ],\n  \"Seminars and Workshops\": [\n    \"Attended a workshop on “Patent Drafting” organized by the Department of Artificial Intelligence and Machine Learning in association with CMRIT Institution’s Innovation Council.\",\n    \"Attended a seminar on “Generative AI” organized by CMR Institute of Technology.\",\n    \"Attended a seminar on “Startup and Innovation” organized by CMR Institute of Technology.\"\n  ],\n  \"Patents\": [\n    {\n      \"Name\": \"AI Powered Pet Monitoring System\",\n      \"Description\": \"Developed a smart system using AI and computer vision to monitor pet behaviour, detect health anomalies, and send real-time alerts to owners. Filed for patent protection to secure innovation in intelligent pet care technology.\"\n    }\n  ],\n  \"NSS\": [\n    \"Actively participated in orphanage visits, engaging with children through interactive activities, distributing books, stationery, and meals, and organizing sessions that encouraged learning and emotional support.\"\n  ],\n  \"Technical Clubs\": [\n    \"Member of Cybernauts, club of the Department of Artificial Intelligence and Machine Learning.\"\n  ]\n}\n\n"
  },
  {
    "insert": "AWARDS AND ACHIEVEMENTS:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "[\n  \"Received a Certificate of Appreciation for designing posters for the “Open Day” event held on 17th May 2025 organized by CMR Institute of Technology.\",\n  \"Served as the Class Representative in the 1ˢᵗ and 2ⁿᵈ semesters.\"\n]\n\n"
  },
  {
    "insert": "PERSONAL DETAILS:\n",
    "attributes": {
      "bold": true,
      "size": "large"
    }
  },
  {
    "insert": "{\n  \"Date of Birth\": \"12/10/2004\",\n  \"Gender\": \"Male\",\n  \"Nationality\": \"Indian\",\n  \"Linguistic Competencies\": [\n    \"English\",\n    \"Kannada\",\n    \"Hindi\",\n    \"Telugu\",\n    \"German\"\n  ],\n  \"Hobbies\": [\n    \"Travelling\",\n    \"Photography\",\n    \"Dancing\",\n    \"Cooking\",\n    \"Playing Video Games\"\n  ]\n}\n\n"
  }
]